Revit 2027 API
ComponentRepeaterSlot.MakeEmpty Method
 Makes the slot empty by removing the instance currently held by the slot.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void MakeEmpty()
Public Sub MakeEmpty
public:
void MakeEmpty()
member MakeEmpty : unit -> unit
See Also
Reference
ComponentRepeaterSlot Class
Autodesk.Revit.DB Namespace